content/post/nfs-over-rdma/logs/tcp_fio_bs1024k_iodepth4.log
task1: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=4
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=16687: Sat Jul 20 23:03:27 2024
  read: IOPS=2667, BW=2668MiB/s (2797MB/s)(78.2GiB/30002msec)
    slat (usec): min=30, max=912, avg=33.23, stdev= 4.70
    clat (usec): min=740, max=5577, avg=1465.62, stdev=169.13
     lat (usec): min=772, max=5741, avg=1498.85, stdev=169.38
    clat percentiles (usec):
     |  1.00th=[ 1303],  5.00th=[ 1336], 10.00th=[ 1336], 20.00th=[ 1352],
     | 30.00th=[ 1369], 40.00th=[ 1401], 50.00th=[ 1418], 60.00th=[ 1450],
     | 70.00th=[ 1467], 80.00th=[ 1516], 90.00th=[ 1647], 95.00th=[ 1827],
     | 99.00th=[ 2147], 99.50th=[ 2212], 99.90th=[ 2311], 99.95th=[ 2474],
     | 99.99th=[ 2769]
   bw (  MiB/s): min= 2574, max= 2800, per=100.00%, avg=2668.34, stdev=40.79, samples=59
   iops        : min= 2574, max= 2800, avg=2668.34, stdev=40.79, samples=59
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=97.20%, 4=2.79%, 10=0.01%
  cpu          : usr=0.32%, sys=9.19%, ctx=80039, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=80038,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2668MiB/s (2797MB/s), 2668MiB/s-2668MiB/s (2797MB/s-2797MB/s), io=78.2GiB (83.9GB), run=30002-30002msec