content/post/nfs-over-rdma/logs/tcp_fio_bs16k_iodepth32.log
task1: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=32
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=9483: Sat Jul 20 21:32:12 2024
  read: IOPS=50.2k, BW=784MiB/s (822MB/s)(23.0GiB/30001msec)
    slat (nsec): min=1443, max=71586, avg=2637.28, stdev=512.94
    clat (usec): min=243, max=2411, avg=634.84, stdev=113.25
     lat (usec): min=245, max=2414, avg=637.48, stdev=113.23
    clat percentiles (usec):
     |  1.00th=[  437],  5.00th=[  482], 10.00th=[  510], 20.00th=[  545],
     | 30.00th=[  570], 40.00th=[  594], 50.00th=[  619], 60.00th=[  652],
     | 70.00th=[  676], 80.00th=[  717], 90.00th=[  766], 95.00th=[  824],
     | 99.00th=[  971], 99.50th=[ 1090], 99.90th=[ 1434], 99.95th=[ 1582],
     | 99.99th=[ 1942]
   bw (  KiB/s): min=713632, max=860960, per=99.91%, avg=802030.64, stdev=29379.67, samples=59
   iops        : min=44602, max=53810, avg=50126.92, stdev=1836.23, samples=59
  lat (usec)   : 250=0.01%, 500=8.03%, 750=79.17%, 1000=11.98%
  lat (msec)   : 2=0.81%, 4=0.01%
  cpu          : usr=3.38%, sys=17.61%, ctx=916602, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=1505224,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=784MiB/s (822MB/s), 784MiB/s-784MiB/s (822MB/s-822MB/s), io=23.0GiB (24.7GB), run=30001-30001msec