content/post/nfs-over-rdma/logs/tcp_fio_bs32k_iodepth64.log
task1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=64
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=10046: Sat Jul 20 21:38:50 2024
  read: IOPS=43.8k, BW=1368MiB/s (1434MB/s)(40.1GiB/30002msec)
    slat (nsec): min=1959, max=80620, avg=3259.17, stdev=647.24
    clat (usec): min=931, max=11108, avg=1458.23, stdev=174.99
     lat (usec): min=934, max=11112, avg=1461.49, stdev=174.99
    clat percentiles (usec):
     |  1.00th=[ 1172],  5.00th=[ 1237], 10.00th=[ 1287], 20.00th=[ 1336],
     | 30.00th=[ 1369], 40.00th=[ 1401], 50.00th=[ 1434], 60.00th=[ 1467],
     | 70.00th=[ 1516], 80.00th=[ 1565], 90.00th=[ 1663], 95.00th=[ 1745],
     | 99.00th=[ 1991], 99.50th=[ 2114], 99.90th=[ 2409], 99.95th=[ 2540],
     | 99.99th=[ 2966]
   bw (  MiB/s): min= 1235, max= 1509, per=99.98%, avg=1367.75, stdev=52.24, samples=59
   iops        : min=39548, max=48290, avg=43767.90, stdev=1671.61, samples=59
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=99.06%, 4=0.93%, 20=0.01%
  cpu          : usr=4.00%, sys=18.84%, ctx=1152088, majf=0, minf=520
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=1313389,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=1368MiB/s (1434MB/s), 1368MiB/s-1368MiB/s (1434MB/s-1434MB/s), io=40.1GiB (43.0GB), run=30002-30002msec