content/post/nfs-over-rdma/logs/tcp_fio_bs4k_iodepth128.log
task1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=8533: Sat Jul 20 21:20:59 2024
  read: IOPS=51.7k, BW=202MiB/s (212MB/s)(6065MiB/30003msec)
    slat (nsec): min=1032, max=54510, avg=2301.79, stdev=618.16
    clat (usec): min=1465, max=4553, avg=2470.74, stdev=324.12
     lat (usec): min=1476, max=4555, avg=2473.04, stdev=324.10
    clat percentiles (usec):
     |  1.00th=[ 1876],  5.00th=[ 2008], 10.00th=[ 2089], 20.00th=[ 2212],
     | 30.00th=[ 2278], 40.00th=[ 2343], 50.00th=[ 2442], 60.00th=[ 2507],
     | 70.00th=[ 2606], 80.00th=[ 2737], 90.00th=[ 2900], 95.00th=[ 3064],
     | 99.00th=[ 3392], 99.50th=[ 3556], 99.90th=[ 3884], 99.95th=[ 4047],
     | 99.99th=[ 4293]
   bw (  KiB/s): min=187568, max=224784, per=100.00%, avg=207085.92, stdev=7645.49, samples=59
   iops        : min=46892, max=56196, avg=51771.47, stdev=1911.37, samples=59
  lat (msec)   : 2=4.49%, 4=95.44%, 10=0.06%
  cpu          : usr=3.53%, sys=14.39%, ctx=475707, majf=0, minf=136
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=1552635,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=202MiB/s (212MB/s), 202MiB/s-202MiB/s (212MB/s-212MB/s), io=6065MiB (6360MB), run=30003-30003msec