content/post/nfs-over-rdma/logs/tcp_fio_bs4k_iodepth32.log
task1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=8441: Sat Jul 20 21:19:58 2024
  read: IOPS=50.6k, BW=198MiB/s (207MB/s)(5931MiB/30001msec)
    slat (nsec): min=1094, max=56943, avg=2204.62, stdev=512.10
    clat (usec): min=135, max=2625, avg=629.76, stdev=195.71
     lat (usec): min=138, max=2627, avg=631.96, stdev=195.68
    clat percentiles (usec):
     |  1.00th=[  322],  5.00th=[  388], 10.00th=[  416], 20.00th=[  453],
     | 30.00th=[  490], 40.00th=[  537], 50.00th=[  594], 60.00th=[  668],
     | 70.00th=[  734], 80.00th=[  799], 90.00th=[  889], 95.00th=[  971],
     | 99.00th=[ 1172], 99.50th=[ 1270], 99.90th=[ 1565], 99.95th=[ 1762],
     | 99.99th=[ 2024]
   bw (  KiB/s): min=175416, max=225024, per=100.00%, avg=202929.76, stdev=9671.73, samples=59
   iops        : min=43854, max=56256, avg=50732.47, stdev=2417.97, samples=59
  lat (usec)   : 250=0.16%, 500=32.14%, 750=40.68%, 1000=23.07%
  lat (msec)   : 2=3.93%, 4=0.01%
  cpu          : usr=3.67%, sys=13.49%, ctx=468540, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=1518385,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=198MiB/s (207MB/s), 198MiB/s-198MiB/s (207MB/s-207MB/s), io=5931MiB (6219MB), run=30001-30001msec